app/controllers/posts_controller.rb

	def index
    respond_with Post.all
---
SELECT "posts".* FROM "posts"

  def create
    respond_with Post.create(post_params)
---
INSERT INTO "posts" ("link", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link", "http://google.com"], ["title", "Google"], ["created_at", "2016-04-09 02:39:40.393078"], ["updated_at", "2016-04-09 02:39:40.393078"]]

  def show
    respond_with Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]

  def upvote
    post = Post.find(params[:id])
    post.increment!(:upvotes)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 1], ["updated_at", "2016-04-09 04:10:21.306015"], ["id", 1]]